{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_3", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "block1_conv1", "config": {"activation": "relu", "kernel_constraint": null, "filters": 64, "name": "block1_conv1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block1_conv2", "config": {"activation": "relu", "kernel_constraint": null, "filters": 64, "name": "block1_conv2", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_regularizer": null}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block1_pool", "config": {"pool_size": [2, 2], "trainable": true, "name": "block1_pool", "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv1", "config": {"activation": "relu", "kernel_constraint": null, "filters": 128, "name": "block2_conv1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_regularizer": null}, "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv2", "config": {"activation": "relu", "kernel_constraint": null, "filters": 128, "name": "block2_conv2", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_regularizer": null}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block2_pool", "config": {"pool_size": [2, 2], "trainable": true, "name": "block2_pool", "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv1", "config": {"activation": "relu", "kernel_constraint": null, "filters": 256, "name": "block3_conv1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_regularizer": null}, "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv2", "config": {"activation": "relu", "kernel_constraint": null, "filters": 256, "name": "block3_conv2", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_regularizer": null}, "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv3", "config": {"activation": "relu", "kernel_constraint": null, "filters": 256, "name": "block3_conv3", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_regularizer": null}, "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv4", "config": {"activation": "relu", "kernel_constraint": null, "filters": 256, "name": "block3_conv4", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_regularizer": null}, "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block3_pool", "config": {"pool_size": [2, 2], "trainable": true, "name": "block3_pool", "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["block3_conv4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv1", "config": {"activation": "relu", "kernel_constraint": null, "filters": 512, "name": "block4_conv1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_regularizer": null}, "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv2", "config": {"activation": "relu", "kernel_constraint": null, "filters": 512, "name": "block4_conv2", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_regularizer": null}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv3", "config": {"activation": "relu", "kernel_constraint": null, "filters": 512, "name": "block4_conv3", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_regularizer": null}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv4", "config": {"activation": "relu", "kernel_constraint": null, "filters": 512, "name": "block4_conv4", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_regularizer": null}, "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block4_pool", "config": {"pool_size": [2, 2], "trainable": true, "name": "block4_pool", "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["block4_conv4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv1", "config": {"activation": "relu", "kernel_constraint": null, "filters": 512, "name": "block5_conv1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_regularizer": null}, "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv2", "config": {"activation": "relu", "kernel_constraint": null, "filters": 512, "name": "block5_conv2", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_regularizer": null}, "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv3", "config": {"activation": "relu", "kernel_constraint": null, "filters": 512, "name": "block5_conv3", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_regularizer": null}, "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv4", "config": {"activation": "relu", "kernel_constraint": null, "filters": 512, "name": "block5_conv4", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "kernel_regularizer": null}, "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block5_pool", "config": {"pool_size": [2, 2], "trainable": true, "name": "block5_pool", "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["block5_conv4", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "name": "global_average_pooling2d_1", "config": {"trainable": true, "data_format": "channels_last", "name": "global_average_pooling2d_1"}, "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"activation": "relu", "kernel_constraint": null, "name": "dense_1", "units": 512, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null}, "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"noise_shape": null, "name": "dropout_1", "trainable": true, "seed": null, "rate": 0.5}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"activation": "relu", "kernel_constraint": null, "name": "dense_2", "units": 512, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"noise_shape": null, "name": "dropout_2", "trainable": true, "seed": null, "rate": 0.5}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"activation": "softmax", "kernel_constraint": null, "name": "dense_3", "units": 3, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}]}, "keras_version": "2.2.2", "backend": "tensorflow"}