{"keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Model", "config": {"output_layers": [["dense_4", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"name": "input_1", "config": {"batch_input_shape": [null, null, null, 3], "name": "input_1", "sparse": false, "dtype": "float32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "block1_conv1", "config": {"use_bias": true, "filters": 64, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "name": "block1_conv1", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "block1_conv2", "config": {"use_bias": true, "filters": 64, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "name": "block1_conv2", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}, "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"name": "block1_pool", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "name": "block1_pool", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"name": "block2_conv1", "config": {"use_bias": true, "filters": 128, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "name": "block2_conv1", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}, "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"name": "block2_conv2", "config": {"use_bias": true, "filters": 128, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "name": "block2_conv2", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}, "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"name": "block2_pool", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "name": "block2_pool", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"name": "block3_conv1", "config": {"use_bias": true, "filters": 256, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "name": "block3_conv1", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}, "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"name": "block3_conv2", "config": {"use_bias": true, "filters": 256, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "name": "block3_conv2", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"name": "block3_conv3", "config": {"use_bias": true, "filters": 256, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "name": "block3_conv3", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"name": "block3_pool", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "name": "block3_pool", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"name": "block4_conv1", "config": {"use_bias": true, "filters": 512, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "name": "block4_conv1", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}, "class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"name": "block4_conv2", "config": {"use_bias": true, "filters": 512, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "name": "block4_conv2", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"name": "block4_conv3", "config": {"use_bias": true, "filters": 512, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "name": "block4_conv3", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"name": "block4_pool", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "name": "block4_pool", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"name": "block5_conv1", "config": {"use_bias": true, "filters": 512, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "name": "block5_conv1", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}, "class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"name": "block5_conv2", "config": {"use_bias": true, "filters": 512, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "name": "block5_conv2", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"name": "block5_conv3", "config": {"use_bias": true, "filters": 512, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "name": "block5_conv3", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"name": "block5_pool", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "name": "block5_pool", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"name": "global_average_pooling2d_1", "config": {"trainable": true, "name": "global_average_pooling2d_1", "data_format": "channels_last"}, "class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"name": "dense_1", "config": {"trainable": true, "use_bias": true, "units": 1024, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}, "class_name": "Dense", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]]}, {"name": "dense_2", "config": {"trainable": true, "use_bias": true, "units": 1024, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}, "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_3", "config": {"trainable": true, "use_bias": true, "units": 512, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}, "class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "dense_4", "config": {"trainable": true, "use_bias": true, "units": 3, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "activation": "softmax", "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}}, "class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}]}}